#Mon Dec 11 07:20:25 PST 2006
XJ111.S=El nombre de tabla for\u00E1nea no puede ser nulo
XJ020.S=El tipo de objeto no es convertible a TYPE ''{0}'', valor java.sql.Types no v\u00E1lido o el objeto es nulo.
XJ200.S=Se ha excedido el n\u00FAmero m\u00E1ximo de secciones {0}
XCL31.S=Sentencia cerrada.
XCL18.S=La corriente del valor de columna del resultado no se puede recuperar dos veces
58010.C=Se ha encontrado un error de protocolo de red.  No se ha podido establecer una conexi\u00F3n debido a que el gestor {0} en el nivel {1} no est\u00E1 soportado en el servidor. 
XJ091.S=Argumento no v\u00E1lido\: el \u00EDndice de par\u00E1metro {0} no es un par\u00E1metro OUT o INOUT.
XJ078.S=El desplazamiento ''{0}'' es inferior a cero o es demasiado grande para el BLOB/CLOB actual.
XN009.S=Error al obtener la longitud del objeto BLOB/CLOB, a continuaci\u00F3n se obtiene una excepci\u00F3n.
XJ076.S=El argumento de posici\u00F3n ''{0}'' supera el tama\u00F1o del BLOB/CLOB.
XCL14.S=La posici\u00F3n de la columna ''{0}'' est\u00E1 fuera de rango.  El n\u00FAmero de columnas de esta sentencia ResultSet es ''{1}''.
J109=Se ha detectado una configuraci\u00F3n de cliente TCP/IP incorrecto.  No se puede determinar la direcci\u00F3n IP del sistema principal local\: ''{0}''.  Aseg\u00FArese de que la m\u00E1quina cliente tenga configurada correctamente la direcci\u00F3n IP.
XJ074.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setQueryTimeout(int segundos).
J108=El gestor de seguridad no permite acceder a la propiedad del sistema {0}.
J107=Error para el elemento del proceso por lotes \#
XJ001.U=Excepci\u00F3n de Java\: ''{1}\: {0}''.
J106=a causa de la excepci\u00F3n
J105=\u00A1La precisi\u00F3n excede de 31 d\u00EDgitos\!
J104=El objeto ya est\u00E1 cerrado.
J103=Se ha generado una excepci\u00F3n al cerrar el servidor de red. {0}
XCL12.S=Se ha intentado colocar un valor de datos de tipo ''{0}'' en un valor de datos de tipo ''{1}''.
J102=Se ha generado una excepci\u00F3n al iniciar el servidor de red. {0}
XJ072.S=Se ha pasado un patr\u00F3n o searchStr nulo a un m\u00E9todo de posici\u00F3n BLOB o CLOB.
J101=No se puede cargar la clase del servidor de red, {0}. {1}  Compruebe la integridad del archivo derbynet.jar.
XJ059.S=No se puede cerrar una conexi\u00F3n mientras siga activa una transacci\u00F3n global.
J100=No se puede encontrar la clase del servidor de red, {0}. La v\u00EDa de acceso a la clase deber\u00EDa contener derbynet.jar.
08001.C.12=No se ha podido establecer una conexi\u00F3n debido a que la contrase\u00F1a tiene una longitud de cero o es mayor que el m\u00E1ximo que permite el protocolo de red.
08001.C.11=No se ha podido establecer una conexi\u00F3n debido a que el id de usuario tiene una longitud de cero o es mayor que el m\u00E1ximo que permite el protocolo de red.
08001.C.10=No se ha podido establecer una conexi\u00F3n debido a que la se\u00F1al de seguridad es mayor que el m\u00E1ximo que permite el protocolo de red.
XJ070.S=Se ha pasado un argumento de posici\u00F3n negativo o cero ''{0}'' en un m\u00E9todo Blob o Clob.
XJ057.S=No se puede comprometer una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de comprometer debe ir a trav\u00E9s de la interfaz XAResource.
XBM0N.D=No se ha podido registrar el controlador JDBC con java.sql.DriverManager. Consulte la excepci\u00F3n siguiente para obtener detalles. 
XN001.S=No se permite un restablecimiento de la conexi\u00F3n dentro de una unidad de trabajo.
22028=La serie excede la longitud m\u00E1xima de {0}.
08000.S.1=No se puede cerrar una conexi\u00F3n con una transacci\u00F3n activa.  La transacci\u00F3n permanece abierta y la conexi\u00F3n no se ha cerrado.
08004.C.2=Se ha rechazado la conexi\u00F3n porque no se ha encontrado la base de datos {0}.
08004=Conexi\u00F3n rechazada\: {0}
08004.C.1=Se ha producido una anomal\u00EDa de autenticaci\u00F3n de conexi\u00F3n.  Raz\u00F3n\: {0}.
08003=Sin conexi\u00F3n actual.
08000=Conexi\u00F3n cerrada por una interrupci\u00F3n desconocida.
22003.S.3=Se ha producido un desbordamiento durante la conversi\u00F3n del tipo de datos num\u00E9rico de ''{0}'' a {1}.
22003.S.2=El decimal s\u00F3lo puede tener un m\u00E1ximo de 31 d\u00EDgitos.
22003.S.1=El a\u00F1o ({0}) excede el m\u00E1ximo ''{1}''.
XJ125.S=Este m\u00E9todo s\u00F3lo debe llamarse en objetos ResultSet que sean desplazables (tipo TYPE_SCROLL_SENSITIVE o TYPE_SCROLL_INSENSITIVE).
22018=Formato de serie de caracteres no v\u00E1lido para tipo {0}.
XCY02.S=El cambio de propiedad solicitado no est\u00E1 soportado ''{0}''\=''{1}''.
XJ214.S=Se ha producido un error de E/S al llamar a free() en un CLOB o BLOB.
0A000.S=Caracter\u00EDstica no implementada\: {0}.
57017.C=No existe ninguna conversi\u00F3n disponible para la p\u00E1gina de c\u00F3digos de origen, {0}, a la p\u00E1gina de c\u00F3digos de destino, {1}.  La conexi\u00F3n se ha finalizado.
XJ123.S=Este m\u00E9todo debe llamarse para actualizar los valores de la fila actual o de la fila de inserci\u00F3n.
XJ212.S=Sintaxis de atributo no v\u00E1lida\: {0}
58009.C=Se ha encontrado un error de protocolo de red y se ha finalizado la conexi\u00F3n\: {0}
XJ121.S=Operaci\u00F3n no v\u00E1lida en la posici\u00F3n actual del cursor.
XJ108.S=Tama\u00F1o de bloque no permitido
XJ030.S=No se puede establecer AUTOCOMMIT ON si est\u00E1 en una conexi\u00F3n anidada.
XJ210.S=No se ha encontrado el nombre del m\u00F3dulo de carga para el procedimiento almacenado en el servidor.
X0Y79.S=No se puede llamar Statement.executeUpdate() con una sentencia que devuelve un ResultSet.
XJ017.S=No se permite el mandato SAVEPOINT dentro de un c\u00F3digo de desencadenantes.
XJ088.S=Operaci\u00F3n no v\u00E1lida\: se ha llamado a wasNull() sin datos recuperados.
XJ106.S=No existe dicho relleno 
XN019.S=Error al ejecutar {0}, el servidor ha devuelto {1}.
XJ086.S=Este m\u00E9todo no se puede invocar mientras el cursor no est\u00E1 en la fila de inserci\u00F3n o si la concurrencia de este objeto ResultSet es CONCUR_READ_ONLY.
XJ104.S=La longitud de clave compartida no es v\u00E1lida\: {0}.
XJ015.M=Conclusi\u00F3n del sistema Derby.
XN017.S=Error de protocolo de red\: se ha alcanzado de forma prematura el final de la corriente, par\u00E1metro \#{0}.  Los datos restantes se han rellenado con 0x0.
XJ013.S=No hay ID para SAVEPOINT con nombre.
XJ084.U=La columna no corresponde a una columna de la tabla base. No se puede emitir ''{0}'' en esta columna.
22005=Se ha intentado obtener un valor de datos de tipo ''{0}'' de un valor de datos de tipo ''{1}''.
XJ102.S=No se puede realizar una inserci\u00F3n en la posici\u00F3n actual.
XJ04B.S=El proceso por lotes no puede contener un mandatos que intente devolver un juego de resultados.
22003=El valor resultante queda fuera del rango para el tipo de datos {0}.
XN015.S=Error de protocolo de red\: el tama\u00F1o especificado de InputStream, par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
XJ011.S=No se puede pasar un valor nulo como nombre de SAVEPOINT.
XJ082.U=No se permiten los valores BLOB/CLOB como receptor o par\u00E1metros de m\u00E9todo.
XJ069.S=No se permiten m\u00E9todos SetXXX en el caso de USING execute statement.
XJ100.S=La escala proporcionada por el m\u00E9todo registerOutParameter no coincide con el m\u00E9todo setter. \u00A1Posible p\u00E9rdida de precisi\u00F3n\!
XN013.S=Orientaci\u00F3n de desplazamiento no v\u00E1lida.
01J13=El n\u00FAmero de filas devueltas ({0}) es demasiado grande para caber en un entero; el valor devuelto se truncar\u00E1.
XJ080.S=USING execute statement ha pasado {0} par\u00E1metros en lugar de {1}.
01J12=No se puede obtener el texto de mensaje desde el servidor. Consulte la excepci\u00F3n siguiente. El procedimiento almacenado SYSIBM.SQLCAMESSAGE no est\u00E1 instalado en el servidor. P\u00F3ngase en contacto con el administrador de bases de datos.
XJ067.S=El puntero de texto SQL es nulo.
01J11=Los conjuntos de resultados insensibles a desplazamiento no est\u00E1n soportados por el servidor; se est\u00E1 volviendo a correlacionar con el cursor de s\u00F3lo lectura
01J10=Los conjuntos de resultados sensibles a desplazamiento no est\u00E1n soportados por el servidor; se est\u00E1 volviendo a correlacionar con el cursor de s\u00F3lo avance
XN011.S=La longitud del nombre de procedimiento {0} no est\u00E1 dentro del rango v\u00E1lido entre 1 y {1}.
58009.C.9=Excepci\u00F3n de protocolo de red\: la longitud PKGNAMCSN, {0}, no es v\u00E1lida en SQLAM {1}.  La conexi\u00F3n se ha finalizado.
58009.C.8=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para PKGID.  La conexi\u00F3n se ha finalizado.
XIE08.S=No existe una columna denominada\: {0}.  
58009.C.7=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBCOLID.  La conexi\u00F3n se ha finalizado.
58009.C.6=Se ha intentado materializar por completo datos lob demasiado grandes para JVM.  La conexi\u00F3n se ha finalizado.
58009.C.5=No hay suficientes datos mientras se lee desde la red - se esperaba un m\u00EDnimo de {0} y s\u00F3lo se han recibido {1} bytes.  La conexi\u00F3n se ha finalizado.
XJ065.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setFetchSize(int rows).
58009.C.4=Se ha producido un error durante un restablecimiento de conexi\u00F3n diferido y la conexi\u00F3n se ha finalizado.  Consulte las excepciones encadenadas para obtener detalles.
58009.C.3=Se ha detectado un error de comunicaciones\: {0}.
58009.C.2=SocketException\: ''{0}''
XJ063.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxRows(int maxRows).  El valor del par\u00E1metro debe ser >\= 0.
X0Y78.S.2=Se ha llamado a {0}.executeQuery() pero no se ha devuelto ning\u00FAn conjunto de resultados. Utilice {1}.executeUpdate() si no se trata de consultas.
X0Y78.S.1=No se puede llamar {0}.executeQuery() porque se han devuelto m\u00FAltiples conjuntos de resultados.  Utilice {1}.execute() para obtener m\u00FAltiples resultados.
XJ061.S=El m\u00E9todo ''{0}'' s\u00F3lo est\u00E1 permitido sobre cursores de desplazamiento.
01J09=No se ha podido abrir ResultSet con concurrencia {0}. Se est\u00E1 utilizando la concurrencia de ResultSet {1}.
01J08=No se ha podido abrir el tipo de resultSet {0}. El tipo de ResultSet {1} est\u00E1 abierto.
01J07=ResultSetHoldability restringido a ResultSet.CLOSE_CURSORS_AT_COMMIT para una transacci\u00F3n global.
01J06=ResultSet no actualizable. La consulta no califica para generar un ResultSet actualizable.
XCL16.S.1=ResultSet no abierto.  Verifique que AutoCommit sea OFF.
J028=v\u00EDa de acceso de seguridad para la recuperaci\u00F3n en avance
XJ044.S=''{0}'' no es una escala v\u00E1lida.
J025=v\u00EDa de acceso del directorio de anotaci\u00F3n cronol\u00F3gica
J023=contrase\u00F1a de usuario
08003.C.3=La conexi\u00F3n f\u00EDsica subyacente est\u00E1 obsoleta o cerrada.
J022=nombre usuario
08003.C.2=El m\u00E9todo Lob llamado despu\u00E9s de una conexi\u00F3n se ha cerrado
J021=territorio de la base de datos
08003.C.1=getConnection() no v\u00E1lido en una Conexi\u00F3nAgrupada cerrada.
J020=clave de cifrado secreta
XJ042.S=''{0}'' no es un valor v\u00E1lido para la propiedad ''{1}''.
XJ209.S=El proceso almacenado necesario no est\u00E1 instalado en el servidor.
XJ118.S=Se ha solicitado un proceso por lotes de consulta en una sentencia que no referente a una consulta.
XJ207.S=No se puede utilizar el m\u00E9todo executeQuery para la actualizaci\u00F3n.
58017.C=El valor del par\u00E1metro de DDM 0x{0} no est\u00E1 soportado.  Es posible que una variable de lenguaje principal de entrada no est\u00E9 dentro del rango que soporta el servidor.  La conexi\u00F3n se ha finalizado.
XJ098.S=El valor de claves generadas autom\u00E1ticamente {0} no es v\u00E1lido
XJ116.S=No se puede a\u00F1adir m\u00E1s de {0} mandatos a un \u00FAnico proceso por lotes.
XJ025.S=La corriente de entrada no puede tener una longitud negativa.
XJ096.S=No se ha encontrado un paquete de recursos en el paquete {0} para {1}
58015.C=El objeto de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
XJ114.S=Nombre de cursor no v\u00E1lido ''{0}''
XJ023.S=La corriente de entrada no conten\u00EDa la cantidad exacta de datos que la longitud solicitada.
J019=clave de cifrado externa
XJ203.S=El nombre de cursor ''{0}'' ya se utiliza
J018=longitud de clave de cifrado
XJ040.C=No se ha podido iniciar la base de datos ''{0}'', consulte la excepci\u00F3n siguiente para obtener detalles.
J017=algoritmo criptogr\u00E1fico
J016=suministrador de servicio criptogr\u00E1fico
XJ094.S=Este objeto ya est\u00E1 cerrado.
XJ112.S=Se ha encontrado una excepci\u00F3n de seguridad, consulte la excepci\u00F3n siguiente para obtener detalles.
J013=actualizar base de datos
42622=El nombre ''{0}'' es demasiado largo. La longitud m\u00E1xima es ''{1}''.
XJ021.S=El tipo no est\u00E1 soportado.
22007.S.181=La sintaxis de la representaci\u00F3n de serie de un valor de fecha y hora es incorrecta.
XJ008.S=No se puede retrotraer o liberar un SAVEPOINT en modalidad AutoCommit.
J010=cifrar base de datos en disco
XJ092.S=El par\u00E1metro 1 es la cl\u00E1usula de retorno de la llamada de procedimiento almacenado. S\u00F3lo se puede registrar como un tipo entero.
XJ110.S=El nombre de tabla primaria no puede ser nulo
XJ079.S=La longitud ''{0}'' especificada supera el tama\u00F1o del BLOB/BLOB.
2D521.S.2=COMMIT o ROLLBACK no v\u00E1lido para el entorno de ejecuci\u00F3n de aplicaci\u00F3n. 
2D521.S.1=setAutoCommit(true) no v\u00E1lido durante una transacci\u00F3n global.
XJ090.S=Par\u00E1metro no v\u00E1lido\: el calendario es nulo.
XJ077.S=Se ha obtenido una excepci\u00F3n al intentar leer el primer byte/car\u00E1cter del patr\u00F3n BLOB/CLOB mediante getBytes/getSubString.
58009.C.21=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBNAM.  La conexi\u00F3n se ha finalizado.
58009.C.20=Excepci\u00F3n de protocolo de red\: s\u00F3lo uno de NVCM o NVCS puede ser no nulo.  La conexi\u00F3n se ha finalizado.
XJ05B.C=El atributo de JDBC ''{0}'' tiene un valor ''{1}'' no v\u00E1lido, los valores v\u00E1lidos son ''{2}''.
XN008.S=El proceso de la consulta se ha finalizado debido a un error en el servidor.
XCL13.S=La posici\u00F3n del par\u00E1metro ''{0}'' est\u00E1 fuera de rango.  El n\u00FAmero de par\u00E1metros de esta sentencia preparada es ''{1}''.
J008=sin detalles
XJ073.S=Los datos de este BLOB o CLOB ya no est\u00E1n disponibles.  La transacci\u00F3n de BLOB/CLOB podr\u00EDa estar comprometida o su conexi\u00F3n se ha cerrado.
J007=crear base de datos
J005=concluir Derby
08006.C.1=Se ha producido un error durante un restablecimiento de la conexi\u00F3n y se ha finalizado la conexi\u00F3n.  Consulte las excepciones encadenadas para obtener detalles.
J004=identidad de base de datos
XJ004.C=Base de datos ''{0}'' no encontrada.
XJ071.S=Se ha pasado un argumento de longitud negativo ''{0}'' en un m\u00E9todo BLOB o CLOB.
22005.S.6=Tipo SQL Java no reconocido {0}.
22005.S.5=Tipo JDBC no v\u00E1lido para el par\u00E1metro {0}.
XN002.U=No se ha devuelto SECTKN.
XJ058.S=No se puede retrotraer una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de comprometer debe ir a trav\u00E9s de la interfaz XAResource.
22005.S.4=Tipo JDBC no reconocido. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
58009.C.19=Excepci\u00F3n de protocolo de red\: no se ha devuelto SECTKN.  La conexi\u00F3n se ha finalizado.
22005.S.3=La serie Unicode no se puede convertir a la serie Ebcdic
58009.C.18=Excepci\u00F3n de protocolo de red\: FDOCA LID no v\u00E1lido.  La conexi\u00F3n se ha finalizado.
22005.S.2=El convertidor de caracteres necesario no est\u00E1 disponible.
58009.C.17=Excepci\u00F3n de protocolo de red\: se ha alcanzado de forma prematura el final de la corriente al leer InputStream, par\u00E1metro \#{0}.  La conexi\u00F3n se ha finalizado.
22005.S.1=No se ha podido convertir un valor del tipo ''{0}'' al tipo ''{1}'' \: la codificaci\u00F3n no est\u00E1 soportada.
58009.C.16=Excepci\u00F3n de protocolo de red\: DSS encadenado con el mismo id al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
58009.C.15=Excepci\u00F3n de protocolo de red\: la longitud de DSS no es 0 al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
58009.C.14=Excepci\u00F3n de protocolo de red\: la pila de la colecci\u00F3n no est\u00E1 vac\u00EDa al final del mismo an\u00E1lisis de cadena de id.  La conexi\u00F3n se ha finalizado.
XJ056.S=No se puede establecer AUTOCOMMIT ON si est\u00E1 en una conexi\u00F3n XA.
58009.C.13=Excepci\u00F3n de protocolo de red\: la colecci\u00F3n DDM contiene menos de 4 bytes de datos.  La conexi\u00F3n se ha finalizado.
58009.C.12=Excepci\u00F3n de protocolo de red\: el punto de c\u00F3digo real, {0}, no coincide con el punto de c\u00F3digo esperado, {1}.  La conexi\u00F3n se ha finalizado.
58009.C.11=La conexi\u00F3n se ha finalizado porque la codificaci\u00F3n no est\u00E1 soportada.
58009.C.10=Excepci\u00F3n de protocolo de red\: s\u00F3lo una longitud de VCM o VCS puede ser mayor que 0.  La conexi\u00F3n se ha finalizado.
XJ050.U=La base de datos necesita actualizarse desde la versi\u00F3n {0}, establezca el atributo ''upgrade\=true'' en el URL de conexi\u00F3n JDBC para permitir la actualizaci\u00F3n a la versi\u00F3n {1}.
XJ128.S=No se ha podido deshacer el recorte para ''{0}''
XJ126.S=Este m\u00E9todo no debe llamarse en cursores din\u00E1micos sensibles.
XJ215.S=Despu\u00E9s de llamar al m\u00E9todo free() no puede invocar otros m\u00E9todos java.sql.Clob/java.sql.Blob.
XJ124.S=Columna no actualizable.
XJ122.S=No se han llamado m\u00E9todos updateXXX en esta fila.
24000=Estado del cursor no v\u00E1lido - sin fila actual.
XJ018.S=El nombre de columna no puede ser nulo.
XJ211.S=Se ha producido una excepci\u00F3n de ruptura de cadena no recuperable durante el proceso por lotes. El proceso por lotes finaliza de manera no at\u00F3mica.
XJ089.S=Llamada de m\u00E9todo no v\u00E1lida\: el par\u00E1metro 1 es un par\u00E1metro OUT entero devuelto por el procedimiento almacenado, utilice la llamada getInt.
XJ107.S=Relleno incorrecto
XJ016.S=El m\u00E9todo ''{0}'' no est\u00E1 permitido en una sentencia preparada.
XCL27.S=No se puede establecer devolver par\u00E1metros de salida.
XJ213.C=La propiedad de conexi\u00F3n traceLevel no tiene un formato v\u00E1lido para un n\u00FAmero.
XJ105.S=La clave DES tiene una longitud incorrecta; longitud esperada {0}, longitud obtenida {1}.
XN018.S=Error de protocolo de red\: el tama\u00F1o especificado de Reader (Lector), par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
XJ014.S=No hay nombre para SAVEPOINT sin nombre.
XJ085.S=La corriente ya se ha le\u00EDdo, se ha alcanzado el fin de archivo y no se puede volver a utilizar.
XJ103.S=El nombre de tabla no puede ser nulo
22015.S.1=Conversi\u00F3n de datos no v\u00E1lida\: la conversi\u00F3n solicitada producir\u00EDa una p\u00E9rdida de precisi\u00F3n de {0}
XJ04C.S=El proceso por lotes CallableStatement no puede contener par\u00E1metros de salida.
XN016.S=Error de protocolo de red\: se ha encontrado un error en la verificaci\u00F3n de longitud de corriente, par\u00E1metro \#{0}.  Mensaje\: {1}.
XJ012.S=''{0}'' ya est\u00E1 cerrado.
XJ083.U=''{0}'' no permitido porque el ResultSet no es un ResultSet actualizable. 
42X74=Sintaxis de la sentencia CALL no v\u00E1lida.
XN014.S=Error de protocolo de red\: se ha encontrado una excepci\u00F3n de E/S (IOException), par\u00E1metro \#{0}.  Los datos restantes se han rellenado con 0x0. Mensaje\: {1}.
XJ010.S=No se puede emitir un SAVEPOINT cuando autoCommit est\u00E1 activado.
XCL08.S=El cursor ''{0}'' no est\u00E1 sobre una fila.
XJ081.S=Se ha pasado el valor ''{0}'' no v\u00E1lido como par\u00E1metro ''{1}'' al m\u00E9todo ''{2}''
XJ068.S=S\u00F3lo est\u00E1n permitidos executeBatch y clearBatch en mitad de un proceso por lotes.
XN012.S=En plataformas {0}, XA soporta la versi\u00F3n {1} y superiores, \u00E9sta es la versi\u00F3n {2}
XJ066.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxFieldSize(int max).
XN010.S=El nombre del procedimiento no puede ser nulo.
J133=La contrase\u00F1a de usuario para la conexi\u00F3n
J132=El nombre de usuario para la conexi\u00F3n
J131=Se ha detectado un error de sintaxis de corriente de datos de PROTOCOL.  Raz\u00F3n\: 0x{0}.
J130=Se ha detectado un error de descripci\u00F3n de FDOCA no v\u00E1lido de PROTOCOL
XJ064.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para setFetchDirection(int direction).
0A000.S.7=El tipo de datos ''{0}'' no est\u00E1 soportado.
XJ081.C=Se han especificado atributos de creaci\u00F3n/restauraci\u00F3n/recuperaci\u00F3n que entran en conflicto.
0A000.S.5=El mecanismo de seguridad ''{0}'' no est\u00E1 soportado.
0A000.S.4=El servidor no da soporte a sercancel().
08006.D=Conclusi\u00F3n de la base de datos ''{0}''.
0A000.S.3=La propiedad resultSetHoldability {0} no est\u00E1 soportada
0A000.S.2=El m\u00E9todo JDBC {0} no est\u00E1 soportado por el servidor. Actualice el servidor.
24501.S=El cursor identificado no est\u00E1 abierto.
0A000.S.1=El m\u00E9todo JDBC todav\u00EDa no se ha implementado.
XJ062.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para ResultSet.setFetchSize(int rows).
J129=se ha emitido un mandato Open Query (Abrir consulta) para una consulta que ya estaba abierta
J128=el cursor no est\u00E1 abierto
XJ045.S=Se ha pasador un nivel de aislamiento no v\u00E1lido o no soportado (actualmente), ''{0}'', a Connection.setTransactionIsolationLevel(). Los valores a los que actualmente se da soporte son java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED y java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
J127=parseSQLDIAGGRP todav\u00EDa no se ha implementado
J126=se ha detectado un error de protocolo de conversaci\u00F3n.  Raz\u00F3n\: 0x{0}.
XJ049.C=Se han especificado atributos de creaci\u00F3n que entran en conflicto.
J125=se ha detectado un error de discrepancia de descriptor de datos.
J124=el mandato de acceso a base de datos relacional (ACCRDB) no se puede emitir porque ya se ha accedido actualmente a la base de datos
J123=el mandato solicitado ha encontrado una condici\u00F3n espec\u00EDfica de la implementaci\u00F3n y sin arquitectura para la cual no existe ning\u00FAn mensaje con arquitectura
J122=se ha emitido un mandato que solicita servicios de la base de datos antes del mandato que solicita acceso a la base de datos (ACCRDB)
J121=el usuario no tiene autorizaci\u00F3n para acceder a la base de datos
J120=no se ha especificado
07000=Al menos un par\u00E1metro de la sentencia actual no est\u00E1 inicializado.
25001=No se puede cerrar una conexi\u00F3n mientras todav\u00EDa siga activa una transacci\u00F3n.
XJ208.S=Anomal\u00EDa de proceso por lotes no at\u00F3mico.  Se ha sometido el proceso por lotes, pero se ha producido como m\u00EDnimo una excepci\u00F3n en un miembro individual del proceso por lotes. Utilice getNextException() para recuperar las excepciones para elementos procesados por lotes espec\u00EDficos.
XJ099.S=El objeto Reader/Stream (Lector/Corriente) no contiene caracteres de longitud
XJ117.S=El proceso por lotes de consultas no est\u00E1 permitido por conformidad a J2EE.
23502=La columna ''{0}'' no puede aceptar un valor NULL.
XJ206.S=El texto SQL ''{0}'' no contiene se\u00F1ales.
42ZA1=SQL no v\u00E1lido en el proceso por lotes\: ''{0}''.
58016.C=El par\u00E1metro de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
XJ097.S=No se puede retrotraer o liberar un SAVEPOINT que no haya sido creado por esta conexi\u00F3n.
08001.C.9=No se ha podido establecer una conexi\u00F3n debido a que el nombre de base de datos ''{0}'' es mayor que la longitud m\u00E1xima que permite el protocolo de red.
XJ115.S=No se puede abrir resultSet con la capacidad de retenci\u00F3n solicitada {0}.
08001.C.8=La contrase\u00F1a no puede ser nula.
08001.C.7=El id de usuario no puede ser nulo.
08001.C.6=La longitud de la contrase\u00F1a ({0}) est\u00E1 fuera del rango entre 1 y {1}.
XJ041.C=No se ha podido crear la base de datos ''{0}'', consulte la excepci\u00F3n siguiente para obtener detalles.
3B502.S=Se ha especificado RELEASE o ROLLBACK TO SAVEPOINT, pero no existe ning\u00FAn SAVEPOINT.
08001.C.5=El id de usuario ({0}) est\u00E1 fuera del rango entre 1 y {1}.
J118=contrase\u00F1a caducada
XJ204.S=No se puede abrir el conjunto de resultados con la capacidad de retenci\u00F3n solicitada {0}.
08001.C.4=No se puede abrir la corriente en el socket\: ''{0}''.
XJ028.C=El URL ''{0}'' no est\u00E1 formado correctamente.
J117=falta SECTKN en ACCSEC cuando es necesario o no es v\u00E1lido
58014.C=El mandato de DDM 0x{0} no est\u00E1 soportado.  La conexi\u00F3n se ha finalizado.
08001.C.3=SocketException\: ''{0}''
XJ095.S=Ha fallado un intento de ejecutar una acci\u00F3n privilegiada.
J116=error no reintentable del servicio de seguridad local
X0X95.S=No se puede realizar la operaci\u00F3n ''{0}'' sobre el objeto ''{1}'' porque existe un ResultSet abierto que depende de ese objeto.
XJ113.S=No se puede abrir el archivo {0} \: {1}
08001.C.2={0} \: Error al conectarse al servidor {1} en el puerto {2} con el mensaje {3}.
J115=contrase\u00F1a nueva no v\u00E1lida
XJ05C.S=No se puede establecer la constante de retenci\u00F3n ResultSet.HOLD_CURSORS_OVER_COMMIT para una transacci\u00F3n global.
08001.C.1=La propiedad de Derby DataSource {0} necesaria no est\u00E1 establecida.
J114=id de usuario revocado
J113=id de usuario o contrase\u00F1a no v\u00E1lidos
0A000.C.6=El mandato DRDA {0} no est\u00E1 actualmente implementado.  La conexi\u00F3n se ha finalizado.
XJ022.S=No es posible establecer la corriente\: ''{0}''.
J112=falta id de usuario
XJ202.S=Nombre de cursor no v\u00E1lido ''{0}''.
XJ009.S=Es necesario utilizar CallableStatement con llamadas de procedimientos almacenados o utilizar par\u00E1metros de salida\: {0}
J111=falta contrase\u00F1a
J110=mecanismo de seguridad no soportado
XJ093.S=La longitud de BLOB/CLOB, {0}, es demasiado grande.  La longitud no puede exceder de {1}.
