#Mon Dec 11 07:20:28 PST 2006
XJ111.S=Il nome della tabella esterna non pu\u00F2 essere nullo
XJ020.S=Tipo di oggetto non convertibile in TYPE ''{0}'', valore java.sql.Types non valido o oggetto nullo.
XJ200.S=Numero massimo di sezioni {0} superato
XCL31.S=Istruzione chiusa.
XCL18.S=Il flusso del valore della colonna nel risultato non pu\u00F2 essere richiamato due volte
58010.C=Si \u00E8 verificato un errore del protocollo di rete.  Non \u00E8 stato possibile stabilire una connessione perch\u00E8 il gestore {0} a livello {1} non \u00E8 supportato dal server. 
XJ091.S=Argomento non valido\: l''indice del parametro {0} non \u00E8 un parametro OUT o INOUT.
XJ078.S=L''offset ''{0}'' \u00E8 inferiore a zero o troppo grande per il BLOB/CLOB corrente.
XN009.S=Errore relativo alla lunghezza dell''oggetto BLOB/CLOB, segue eccezione.
XJ076.S=L''argomento posizione ''{0}'' supera la dimensione di BLOB/CLOB.
XCL14.S=La posizione della colonna ''{0}'' non \u00E8 compresa nell''intervallo.  Il numero di colonne per ResultSet \u00E8 ''{1}''.
J109=Rilevata una configurazione del client TCP/IP non corretta.  Impossibile determinare l''indirizzo IP dell''host locale\: ''{0}''.  Accertarsi che la macchina del client abbia un indirizzo IP correttamente configurato.
XJ074.S=Valore del parametro ''{0}'' non valido per Statement.setQueryTimeout(int seconds).
J108=Il gestore della sicurezza non consente l''accesso alla propriet\u00E0 del sistema {0}.
J107=Errore per l''elemento batch \#
XJ001.U=Eccezione Java\: ''{1}\: {0}''.
J106=Causato dall''eccezione
J105=La precisione supera 31 cifre\!
J104=L''oggetto \u00E8 stato gi\u00E0 chiuso.
J103=Si \u00E8 verificata un''eccezione durante la chiusura del server di rete. {0}
XCL12.S=\u00C8 stato effettuato un tentativo di inserire un valore dati di tipo ''{0}'' in uno di tipo ''{1}''.
J102=Si \u00E8 verificata un''eccezione durante l''avvio del server di rete. {0}
XJ072.S=Modello nullo o searchStr inviato in un metodo di posizione BLOB o CLOB.
J101=Impossibile caricare la classe del server di rete, {0}. {1} Verificare l''integrit\u00E0 del file derbynet.jar.
XJ059.S=Impossibile chiudere una connessione mentre una transazione globale \u00E8 ancora attiva.
J100=Impossibile trovare la classe del server di rete, {0}. Il percorso di classi deve contenere derbynet.jar.
08001.C.12=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 la lunghezza della password \u00E8 uguale a zero o maggiore della lunghezza consentita dal protocollo di rete.
08001.C.11=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 la lunghezza dell''id utente \u00E8 uguale a zero o maggiore della lunghezza massima consentita dal protocollo di rete.
08001.C.10=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 il token di sicurezza possiede una dimensione superiore rispetto alla dimensione massima consentita dal protocollo di rete.
XJ070.S=Argomento posizione negativo o nullo ''{0}'' inviato in un metodo Blob o Clob.
XJ057.S=Impossibile eseguire l''operazione di commit di una transazione globale utilizzando la Connessione, l''elaborazione del commit deve essere eseguita attraverso l''interfaccia XAResource.
XBM0N.D=Registrazione driver JDBC con java.sql.DriverManager non riuscita. Per i dettagli, consultare l''eccezione successiva. 
XN001.S=Reimpostazione della connessione non consentita all''interno di un''unit\u00E0 di lavoro.
22028=La stringa supera la lunghezza massima di {0}.
08000.S.1=Impossibile chiudere una connessione con una transazione attiva.  La transazione resta aperta e la connessione non \u00E8 stata chiusa.
08004.C.2=La connessione \u00E8 stata rifiutata perch\u00E9 il database {0} non \u00E8 stato trovato.
08004=Connessione rifiutata \: {0}
08004.C.1=Autenticazione della connessione non riuscita.  Motivo\: {0}.
08003=Nessuna connessione corrente.
08000=Connessione chiusa a causa di un''interruzione sconosciuta.
22003.S.3=Si \u00E8 verificato un overflow durante la conversione del tipo di dati numerici di ''{0}'' in {1}.
22003.S.2=Il numero decimale pu\u00F2 contenere 31 cifre.
22003.S.1=L''anno ({0}) supera il massimo ''{1}''.
XJ125.S=Questo metodo deve essere richiamato solo su oggetti ResultSet scorrevoli (tipo TYPE_SCROLL_SENSITIVE o TYPE_SCROLL_INSENSITIVE).
22018=Formato stringa di caratteri non valido per il tipo {0}.
XCY02.S=La modifica della propriet\u00E0 richiesta non \u00E8 supportata ''{0}''\=''{1}''.
XJ214.S=Si \u00E8 verificato un errore IO durante la chiamata indipendente() ad un CLOB o BLOB.
0A000.S=Funzione non implementata\: {0}.
57017.C=Non esiste una conversione disponibile per la pagina del codice di origine, {0}, alla pagina del codice di destinazione, {1}.  La connessione \u00E8 stata terminata.
XJ123.S=Questo metodo deve essere richiamato per aggiornare i valori nella riga corrente o nella riga di inserimento.
XJ212.S=Sintassi dell''attributo non valida\: {0}
58009.C=Si \u00E8 verificato un errore del protocollo di rete e la connessione \u00E8 stata terminata\: {0}
XJ121.S=Operazione non valida alla posizione del cursore corrente.
XJ108.S=Dimensione blocco non valida
XJ030.S=Impossibile impostare AUTOCOMMIT ON in una connessione nidificata.
XJ210.S=Non \u00E8 stato trovato il nome del modulo di caricamento per la procedura memorizzata sul server.
X0Y79.S=Impossibile chiamare Statement.executeUpdate() tramite un''istruzione che restituisce ResultSet.
XJ017.S=Nessun comando savepoint consentito all''interno del codice trigger.
XJ088.S=Operazione non valida\: wasNull() \u00E8 stato chiamato senza alcun dato richiamato.
XJ106.S=Nessuna spaziatura interna 
XN019.S=Errore durante l''esecuzione di {0}, il server ha restituito {1}.
XJ086.S=Non \u00E8 possibile richiamare questo metodo mentre il cursore non si trova sulla riga di inserimento oppure se la simultaneit\u00E0 di questo oggetto ResultSet \u00E8 CONCUR_READ_ONLY.
XJ104.S=Lunghezza chiave condivisa non valida\: {0}.
XJ015.M=Arresto sistema Derby.
XN017.S=Errore del protocollo di rete\: interruzione del flusso anomala, parametro \#{0}.  E'' stata eseguita la spaziatura interna dei dati restanti con 0x0.
XJ013.S=Nessun ID per i savepoint denominati.
XJ084.U=La colonna non corrisponde a una colonna della tabella di database. Impossibile inoltrare ''{0}'' su questa colonna.
22005=\u00C8 stato effettuato un tentativo di ottenere un valore dati di tipo ''{0}'' da uno di tipo ''{1}''.
XJ102.S=Impossibile eseguire un inserimento alla posizione corrente.
XJ04B.S=Il batch non pu\u00F2 contenere un comando che tenti di restituire un insieme di risultati.
22003=Il valore risultante non \u00E8 compreso nell''intervallo per il tipo di dati {0}.
XN015.S=Errore del protocollo di rete\: la dimensione specificata di InputStream, parametro \#{0}, \u00E8 inferiore alla lunghezza reale di InputStream.
XJ011.S=Impossibile inviare un valore nullo per il nome savepoint.
XJ082.U=I valori BLOB/CLOB non sono consentiti come parametri di metodo o destinatari.
XJ069.S=Nessun metodo SetXXX consentito in caso di USING execute statement.
XJ100.S=La scala fornita dal metodo registerOutParameter non corrisponde al metodo setter. Possibile perdita di precisione\!
XN013.S=Orientamento di scorrimento non valido.
01J13=Il numero delle righe restituite ({0}) \u00E8 troppo grande per essere un numero intero; il valore restituito verr\u00E0 troncato.
XJ080.S=USING execute statement ha inviato {0} parametri invece di ''{1}''.
01J12=Impossibile acquisire il testo del messaggio dal server. Consultare l''eccezione seguente. La procedura memorizzata SYSIBM.SQLCAMESSAGE non \u00E8 installata sul server. Contattare l''amministratore del database.
XJ067.S=Il puntatore di testo SQL \u00E8 nullo.
01J11=Le impostazioni di risultati aggiornabili e non sensibili al maiuscolo/minuscolo non sono supportate dal server; eseguire una nuova associazione in un cursore di sola lettura non sensibile al maiuscolo/minuscolo
01J10=Lo scorrimento delle impostazioni di risultati sensibili al maiuscolo/minuscolo non \u00E8 supportato dal server; eseguire una nuova associazione in un cursore a scorrimento in avanti
XN011.S=La lunghezza del nome della procedura {0} non \u00E8 compresa nell''intervallo valido da 1 a {1}.
58009.C.9=Eccezione del protocollo di rete\: lunghezza PKGNAMCSN, {0}, non valida in SQLAM {1}.  La connessione \u00E8 stata terminata.
58009.C.8=Eccezione del protocollo di rete\: lunghezza SCLDTA, {0}, non valida per PKGID.  La connessione \u00E8 stata terminata.
XIE08.S=Non esiste alcuna colonna denominata\: {0}.  
58009.C.7=Eccezione del protocollo di rete\: lunghezza SCLDTA, {0}, non valida per RDBCOLID.  La connessione \u00E8 stata terminata.
58009.C.6=Tentativo di materializzare in modo completo dati lob troppo grandi per la JVM.  La connessione \u00E8 stata terminata.
58009.C.5=Dati insufficienti durante la lettura dalla rete - previsto un minimo di {0} byte e ricevuti solo {1} byte.  La connessione \u00E8 stata terminata.
XJ065.S=Valore parametro ''{0}'' non valido per Statement.setFetchSize(int rows).
58009.C.4=Si \u00E8 verificato un errore durante una reimpostazione di connessione rinviata e la connessione \u00E8 stata terminata.  Per dettagli, consultare l''eccezione correlata.
58009.C.3=E'' stato rilevato un errore di comunicazione\: {0}.
58009.C.2=SocketException\: ''{0}''
XJ063.S=Valore parametro ''{0}'' non valido per Statement.setMaxRows(int maxRows).  Il valore del parametro deve essere >\= 0.
X0Y78.S.2={0}.executeQuery() \u00E8 stato richiamato ma non \u00E8 stata restituita alcuna impostazione di risultato. Utilizzare {1}.executeUpdate() per non query.
X0Y78.S.1={0}.executeQuery() non pu\u00F2 essere richiamato poich\u00E9 sono state restituite pi\u00F9 impostazioni di risultati.  Utilizzare {1}.execute() per acquisire pi\u00F9 risultati.
XJ061.S=Il metodo ''{0}'' \u00E8 consentito solo sui cursori di scorrimento.
01J09=Impossibile aprire ResultSet con simultaneit\u00E0 {0}. Viene utilizzata la simultaneit\u00E0 di ResultSet {1}.
01J08=Impossibile aprire il tipo resultSet {0}. Tipo ResultSet {1} aperto.
01J07=ResultSetHoldability limitato a ResultSet.CLOSE_CURSORS_AT_COMMIT per una transazione globale.
01J06=ResultSet non aggiornabile. La query non \u00E8 qualificata per la generazione di un ResultSet aggiornabile.
XCL16.S.1=ResultSet non aperto.  Verificare che l''autocommit sia in modalit\u00E0 OFF.
J028=percorso di backup per il ripristino rollforward
XJ044.S=''{0}'' non \u00E8 una scala valida.
J025=percorso directory di log
J023=password utente
08003.C.3=Connessione fisica sottostante non aggiornata o chiusa.
J022=nome utente
08003.C.2=Metodo Lob richiamato dopo la chiusura della connessione
J021=impostazioni internazionali per il database
08003.C.1=getConnection() non valido su una PooledConnection chiusa.
J020=chiave crittografica segreta
XJ042.S=''{0}'' non \u00E8 un valore valido per la propriet\u00E0 ''{1}''.
XJ209.S=La procedura memorizzata richiesta non \u00E8 installata sul server.
XJ118.S=Batch di query richiesto su un''istruzione non query.
XJ207.S=Impossibile utilizzare il metodo executeQuery per l''aggiornamento.
58017.C=Il valore del parametro DDM 0x{0} non \u00E8 supportato.  E'' possibile che una variabile host di input non sia presente nell''intervallo che il server supporta.  La connessione \u00E8 stata terminata.
XJ098.S=Valore delle chiavi generato automaticamente {0} non valido
XJ116.S=Non \u00E8 possibile aggiungere pi\u00F9 di {0} ad un singolo batch.
XJ025.S=Il flusso di input non pu\u00F2 avere una lunghezza negativa.
XJ096.S=Non \u00E8 stato possibile trovare il bundle della risorsa nel pacchetto {0} per {1}
58015.C=L''oggetto DDM 0x{0} non \u00E8 supportato.  La connessione \u00E8 stata terminata.
XJ114.S=Nome cursore non valido ''{0}''
XJ023.S=Il flusso di input non disponeva la quantit\u00E0 esatta di dati della lunghezza richiesta.
J019=chiave crittografica esterna
XJ203.S=Nome cursore ''{0}'' gi\u00E0 in uso
J018=lunghezza chiave crittografica
XJ040.C=Impossibile avviare il database ''{0}''; per i dettagli consultare l''eccezione successiva.
J017=algoritmo crittografico
J016=provider servizio crittografico
XJ094.S=Questo oggetto \u00E8 gi\u00E0 chiuso.
XJ112.S=Si \u00E8 verificata un''eccezione di sicurezza, per dettagli consultare l''eccezione successiva.
J013=aggiorna database
42622=Il nome ''{0}'' \u00E8 troppo lungo. La lunghezza massima \u00E8 ''{1}''.
XJ021.S=Tipo non supportato.
22007.S.181=La sintassi della rappresentazione della stringa di un valore data/ora non \u00E8 corretta.
XJ008.S=Impossibile eseguire il rollback o il rilascio di un savepoint in modalit\u00E0 autocommit.
J010=codifica database su disco
XJ092.S=Il parametro 1 \u00E8 la clausola di ritorno della chiamata alla procedura memorizzata. Pu\u00F2 essere registrato come un tipo intero.
XJ110.S=Il nome della tabella primaria non pu\u00F2 essere nullo
XJ079.S=La lunghezza specificata ''{0}'' supera la dimensione di BLOB/BLOB.
2D521.S.2=COMMIT o ROLLBACK non valido per l''ambiente di esecuzione dell''applicazione. 
2D521.S.1=setAutoCommit(true) non valido durante la transazione globale.
XJ090.S=Parametro non valido\: il calendario \u00E8 nullo.
XJ077.S=\u00C8 stata riscontrata un''eccezione durante il tentativo di leggere il primo byte/carattere del modello BLOB/CLOB, utilizzando getBytes/getSubString.
58009.C.21=Eccezione del protocollo di rete\: lunghezza SCLDTA, {0}, non valida per RDBNAM.  La connessione \u00E8 stata terminata.
58009.C.20=Eccezione del protocollo di rete\: solo una lunghezza VCM, NVCS pu\u00F2 essere non nulla.  La connessione \u00E8 stata terminata.
XJ05B.C=L''attributo JDBC ''{0}'' ha un valore non valido ''{1}'', i valori validi sono ''{2}''.
XN008.S=Elaborazione della query terminata a causa di un errore sul server.
XCL13.S=La posizione del parametro ''{0}'' non \u00E8 compresa nell''intervallo.  Il numero dei parametri per questa istruzione preparata \u00E8 ''{1}''.
J008=nessun dettaglio
XJ073.S=I dati presenti nel metodo BLOB o CLOB non sono pi\u00F9 disponibili.  E'' possibile che sia stato eseguito il commit della transazione di BLOB/CLOB oppure la connessione \u00E8 stata chiusa.
J007=crea database
J005=arresta Derby
08006.C.1=Si \u00E8 verificato un errore durante la reimpostazione della connessione e la connessione \u00E8 stata terminata.  Per dettagli, consultare l''eccezione correlata.
J004=identit\u00E0 database
XJ004.C=Database ''{0}'' non trovato.
XJ071.S=Argomento lunghezza negativo ''{0}'' inviato in un metodo BLOB o CLOB.
22005.S.6=Tipo SQL Java {0} non riconosciuto.
22005.S.5=Tipo JDBC non valido per il parametro {0}.
XN002.U=SECTKN non restituito.
XJ058.S=Impossibile eseguire l''operazione di rollback di una transazione globale utilizzando la Connessione, l''elaborazione del commit deve essere eseguita attraverso l''interfaccia XAResource.
22005.S.4=Tipo JDBC non riconosciuto. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
58009.C.19=Eccezione del protocollo di rete\: SECTKN non restituito.  La connessione \u00E8 stata terminata.
22005.S.3=Impossibile convertire la stringa Unicode nella stringa Ebcdic
58009.C.18=Eccezione del protocollo di rete\: FDOCA LID non valido.  La connessione \u00E8 stata terminata.
22005.S.2=Il convertitore del carattere richiesto non \u00E8 disponibile.
58009.C.17=Eccezione del protocollo di rete\: interruzione del flusso durante la lettura di InputStream, parametro \#{0}.  La connessione \u00E8 stata terminata.
22005.S.1=Impossibile convertire un valore di tipo ''{0}'' nel tipo ''{1}'' \: la codifica non \u00E8 supportata.
58009.C.16=Eccezione del protocollo di rete\: DSS concatenato con lo stesso id al termine della stessa analisi di catena id.  La connessione \u00E8 stata terminata.
58009.C.15=Eccezione del protocollo di rete\: lunghezza DSS non 0 al termine della stessa analisi di catena id.  La connessione \u00E8 stata terminata.
58009.C.14=Eccezione del protocollo di rete\: stack di raccolta non vuoto al termine della stessa analisi della catena id.  La connessione \u00E8 stata terminata.
XJ056.S=Impossibile impostare AUTOCOMMIT ON in una connessione XA.
58009.C.13=Eccezione del protocollo di rete\: la raccolta DDM contiene meno di 4 byte di dati.  La connessione \u00E8 stata terminata.
58009.C.12=Eccezione del protocollo di rete\: il punto di codice reale, {0}, non corrisponde al punto di codice previsto, {1}.  La connessione \u00E8 stata terminata.
58009.C.11=La connessione \u00E8 stata terminata perch\u00E9 la codifica non \u00E8 supportata.
58009.C.10=Eccezione del protocollo di rete\: solo una lunghezza VCM, VCS pu\u00F2 essere maggiore di 0.  La connessione \u00E8 stata terminata.
XJ050.U=\u00C8 necessario aggiornare il database dalla versione {0}, impostare l''attributo ''upgrade\=true'' sull''URL della connessione JDBC per consentire l''aggiornamento alla versione {1}.
XJ128.S=Impossibile annullare il ritorno a capo per ''{0}''
XJ126.S=Questo metodo non deve essere richiamato su cursori dinamici sensibili al maiuscolo/minuscolo.
XJ215.S=Non \u00E8 possibile richiamare altri metodi java.sql.Clob/java.sql.Blob dopo aver chiamato il metodo free().
XJ124.S=Colonna non aggiornabile.
XJ122.S=Nessun metodo updateXXX \u00E8 stato richiamato su questa riga.
24000=Stato cursore non valido - nessuna riga corrente.
XJ018.S=Il nome colonna non pu\u00F2 essere nullo.
XJ211.S=Si \u00E8 verificata un''eccezione di interruzione della catena irreversibile durante l''elaborazione batch. L''elaborazione batch \u00E8 stata interrotta non atomicamente.
XJ089.S=Chiamata al metodo non valida\: il parametro 1 \u00E8 un parametro OUT intero restituito dalla procedura memorizzata, utilizzare la chiamata getInt.
XJ107.S=Spaziatura interna non valida
XJ016.S=Metodo ''{0}'' non consentito sull''istruzione preparata.
XCL27.S=Impossibile impostare i parametri output di ritorno.
XJ213.C=La propriet\u00E0 di connessione traceLevel non dispone di un formato valido per un numero.
XJ105.S=La lunghezza della chiave DES non \u00E8 corretta, lunghezza prevista {0}, lunghezza acquisita {1}.
XN018.S=Errore del protocollo di rete\: la dimensione specificata di Reader, parametro \#{0}, \u00E8 inferiore alla lunghezza reale di InputStream.
XJ014.S=Nessun nome per i savepoint che non sono denominati.
XJ085.S=Il flusso \u00E8 stato gi\u00E0 letto, \u00E8 stata raggiunta la fine del file e non \u00E8 possibile riutilizzarlo.
XJ103.S=Il nome della tabella non pu\u00F2 essere nullo
22015.S.1=Invalida conversione di dati\: la conversione richiesta provocherebbe una perdita di precisione di {0}
XJ04C.S=Il batch CallableStatement non pu\u00F2 contenere i parametri di output.
XN016.S=Errore del protocollo di rete\: si \u00E8 verificato un errore nella verifica della lunghezza del flusso, parametro \#{0}.  Messaggio\: {1}.
XJ012.S=''{0}'' gi\u00E0 chiuso.
XJ083.U=''{0}'' non consentito perch\u00E9 ResultSet non \u00E8 un ResultSet aggiornabile. 
42X74=Sintassi dell''istruzione CALL non valida.
XN014.S=Errore del protocollo di rete\: si \u00E8 verificata una IOException, parametro \#{0}.  E'' stata eseguita la spaziatura interna dei dati restanti con 0x0. Messaggio\: {1}.
XJ010.S=Impossibile generare savepoint quando autoCommit \u00E8 attivo.
XCL08.S=Il cursore ''{0}'' non si trova su una riga.
XJ081.S=Valore ''{0}'' non valido inviato come parametro ''{1}'' al metodo ''{2}''
XJ068.S=executeBatch e clearBatch sono consentiti solo durante un batch.
XN012.S=Su piattaforme {0}, XA supporta la versione {1} e successive, questa \u00E8 la versione {2}
XJ066.S=Valore parametro ''{0}'' non valido per Statement.setMaxFieldSize(int max).
XN010.S=Il nome della procedura non pu\u00F2 essere nullo.
J133=La password utente per la connessione
J132=Il nome utente per la connessione
J131=E'' stato rilevato un Errore di sintassi del flusso di dati di PROTOCOL.  Motivo\: 0x{0}.
J130=E'' stato rilevato un Errore di descrizione FDOCA non valida di PROTOCOL
XJ064.S=Valore parametro ''{0}'' non valido per setFetchDirection(int direction).
0A000.S.7=Tipo di dati ''{0}'' non supportato.
XJ081.C=Sono stati specificati degli attributi di creazione/ripristino/recupero in conflitto.
0A000.S.5=Meccanismo di sicurezza ''{0}'' non supportato.
0A000.S.4=cancel() non supportato dal server.
08006.D=Arresto database ''{0}''.
0A000.S.3=Propriet\u00E0 resultSetHoldability {0} non supportata
0A000.S.2=Il metodo JDBC {0} non \u00E8 supportato dal server. Aggiornare il server.
24501.S=Il cursore identificato non \u00E8 aperto.
0A000.S.1=Il metodo JDBC non \u00E8 stato ancora implementato.
XJ062.S=Valore parametro ''{0}'' non valido per ResultSet.setFetchSize(int rows).
J129=E'' stato inoltrato un comando di apertura query per una query gi\u00E0 aperta
J128=Il cursore non \u00E8 aperto
XJ045.S=Livello di isolamento non valido o attualmente non supportato, ''{0}'', inviato a Connection.setTransactionIsolationLevel(). I valori supportati sono java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED e java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
J127=parseSQLDIAGGRP non \u00E8 stato ancora implementato
J126=E'' stato rilevato un errore del protocollo interattivo.  Motivo\: 0x{0}.
XJ049.C=Conflitto durante la creazione degli attributi specificati.
J125=E'' stato rilevato un Errore di mancata corrispondenza del descrittore di dati.
J124=Non \u00E8 possibile inoltrare il comando ACCRDB (access relational database) perch\u00E9 il database \u00E8 gi\u00E0 correntemente in uso
J123=Il comando richiesto ha riscontrato una condizione non strutturata e specifica per l''implementazione per cui non erano presenti messaggi strutturati
J122=Un comando richiedente servizi del database \u00E8 stato inoltrato prima della richiesta di accesso al database (ACCRDB)
J121=L''utente non \u00E8 autorizzato ad accedere al database
J120=Non specificato
07000=Almeno un parametro sull''istruzione corrente non \u00E8 inizializzato.
25001=Impossibile chiudere una connessione se una transazione \u00E8 ancora attiva.
XJ208.S=Batch non atomico non riuscito.  Il batch \u00E8 stato inoltrato, ma si \u00E8 verificata almeno un''eccezione su un membro singolo del batch. Utilizzare getNextException() per richiamare le eccezioni per gli elementi specifici di cui \u00E8 stato eseguito il batch.
XJ099.S=L''oggetto Reader/Stream non contiene i caratteri di lunghezza
XJ117.S=Batch di query non consentito dalla compatibilit\u00E0 J2EE.
23502=La colonna ''{0}'' non pu\u00F2 accettare un valore NULL.
XJ206.S=Il testo SQL ''{0}'' non dispone di token.
42ZA1=SQL non valido in batch\: ''{0}''.
58016.C=Il parametro DDM 0x{0} non \u00E8 supportato.  La connessione \u00E8 stata terminata.
XJ097.S=Impossibile eseguire il rollback o il rilascio di un savepoint creato da questa connessione.
08001.C.9=Non \u00E8 stato possibile stabilire una connessione perch\u00E9 la lunghezza del nome del database ''{0}'' \u00E8 maggiore della lunghezza consentita dal protocollo di rete.
XJ115.S=Impossibile aprire resultSet con holdability richiesto {0}.
08001.C.8=La password non pu\u00F2 essere nulla.
08001.C.7=L''id utente non pu\u00F2 essere nullo.
08001.C.6=Lunghezza password ({0}) fuori dall''intervallo da 1 a {1}.
XJ041.C=Impossibile creare il database ''{0}''; per i dettagli consultare l''eccezione successiva.
3B502.S=\u00C8 stato specificato RELEASE o ROLLBACK TO SAVEPOINT, ma il savepoint non esiste.
08001.C.5=Lunghezza id utente ({0}) fuori dall''intervallo da 1 a {1}.
J118=Password scaduta
XJ204.S=Impossibile aprire l''impostazione del risultato con holdability richiesto {0}.
08001.C.4=Impossibile aprire il flusso sul socket\: ''{0}''.
XJ028.C=URL ''{0}'' non formato correttamente.
J117=SECTKN mancante su ACCSEC quando richiesto o invalido
58014.C=Il comando DDM 0x{0} non \u00E8 supportato.  La connessione \u00E8 stata terminata.
08001.C.3=SocketException\: ''{0}''
XJ095.S=Tentativo di eseguire un''azione privilegiata non riuscito.
J116=Errore irreversibile del servizio di sicurezza locale
X0X95.S=Impossibile eseguire l''operazione ''{0}'' sull''oggetto ''{1}'' poich\u00E9 esiste una dipendenza di ResultSet aperta su tale oggetto.
XJ113.S=Impossibile aprire il file {0} \: {1}
08001.C.2={0} \: Errore di connessione al server {1} sulla porta {2} con messaggio {3}.
J115=Nuova password non valida
XJ05C.S=Impossibile impostare holdability ResultSet.HOLD_CURSORS_OVER_COMMIT per una transazione globale.
08001.C.1=Propriet\u00E0 Derby DataSource {0} richiesta non impostata.
J114=ID utente revocato
J113=Id utente o password non validi
0A000.C.6=Il comando DRDA {0} non \u00E8 attualmente implementato.  La connessione \u00E8 stata terminata.
XJ022.S=Impossibile impostare il flusso\: ''{0}''.
J112=ID utente mancante
XJ202.S=Nome cursore non valido ''{0}''.
XJ009.S=Utilizzo di CallableStatement richiesto per la chiamata della procedura memorizzata o utilizzo dei parametri di output\: {0}
J111=Password mancante
J110=Meccanismo di sicurezza non supportato
XJ093.S=La lunghezza di BLOB/CLOB, {0}, \u00E8 di dimensioni troppo elevate.  Non pu\u00F2 superare {1}.
